Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Mock::VerifyAndClearExpectations(&mock_obj); ... // Verifies and removes the expectations on mock_obj; // also removes the default actions set by ON_CALL(); // returns true if and only if successful.
it_it: Mock::VerifyAndClearExpectations(&mock_obj); ... // Verifica e rimuove le expectation su mock_obj; // rimuove anche le azioni di default impostate da ON_CALL(); // restituisce true se e solo se ha successo.

source: Mock::VerifyAndClearExpectations(foo); } // server is destroyed when it goes out of scope here.
it_it: Mock::VerifyAndClearExpectations(foo); } // qui il server viene distrutto quando esce dallo scope.

source: Mocking Cheat Sheet
it_it: Cheat Sheet del Mocking

source: Mocking Class Templates
it_it: Mock di Classi Template

source: Mocking Destructors
it_it: Mock dei Distruttori

source: Mocking FAQ
it_it: FAQ sui Mock

source: Mocking Free Functions
it_it: Mock di Funzioni Libere [Free]

source: Mocking Methods That Use Move-Only Types
it_it: Mock di Metodi Che Usano Tipi Move-Only

source: Mocking Non-virtual Methods {#MockingNonVirtualMethods}
it_it: Mock di Metodi Non-virtual {#MockingNonVirtualMethods}

source: Mocking Overloaded Methods
it_it: Mock di Metodi Overloaded

source: Mocking Private or Protected Methods
it_it: Il Mock di Metodi Privati or Protetti

source: Mocking Reference
it_it: Guida al Mocking

source: Mocking Side Effects {#MockingSideEffects}
it_it: Effetti Collaterali dei Mock {#MockingSideEffects}

source: Mocking a Class Template {#MockTemplate}
it_it: Mock di una Classe Template {#MockTemplate}

source: Mocking a Normal Class {#MockClass}
it_it: Mock di una Classe Normale {#MockClass}

source: Mocking a method that takes and/or returns move-only types presents some challenges, but nothing insurmountable.
it_it: Il mock di un metodo che accetta e/o restituisce tipi move-only presenta alcune sfide, ma nulla di insormontabile.

source: Mocking concrete classes directly is problematic as it creates a tight coupling between the class and the tests - any small change in the class may invalidate your tests and make test maintenance a pain.
it_it: Creare direttamente mock di classi concrete è problematico in quanto crea uno stretto accoppiamento tra la classe e i test: qualsiasi piccolo cambiamento nella classe può invalidare i test e rendere difficile la manutenzione dei test.

source: Mocking for Dummies
it_it: Mocking per Principianti

source: Mocks are great for what some call "interaction-based" testing: instead of checking the system state at the very end, mock objects verify that they are invoked the right way and report an error as soon as it arises, giving you a handle on the precise context in which the error was triggered.
it_it: I mock sono ottimi per quello che alcuni chiamano test "basati sull'interazione": invece di controllare lo stato del sistema alla fine, gli oggetti mock verificano che siano invocati nel modo giusto e segnalano un errore non appena si verifica, dando un controllo preciso sul contesto in cui si è verificato l'errore.

source: More realistically, you'll specify expectations on multiple mock methods which may be from multiple mock objects.
it_it: Più realisticamente, si specificheranno le expectation su più metodi mock che potrebbero provenire da più oggetti mock.

source: More Assertions
it_it: Altre Asserzioni

source: More String Assertions
it_it: Altre Asserzioni di Stringa

source: More generally, any test that checks that a program terminates (except by throwing an exception) in an expected fashion is also a death test.
it_it: Più in generale, qualsiasi test che controlli se un programma termini (tranne che per un'eccezione) nel modo previsto è un "death test".

source: More generally, to use with a mock function whose signature is R(Args...) the object can be anything convertible to OnceAction<R(Args...)> or Action<R(Args...)>.
it_it: Più in generale, da utilizzare con una funzione mock la cui firma è R(Args...) l'oggetto può essere qualsiasi cosa convertibile in OnceAction<R(Args...)> o Action<R(Args...)>.

source: More generally, to use with a mock function whose signature is `R(Args...)` the object can be anything convertible to `OnceAction<R(Args...)>` or `Action<R(Args...)`>.
it_it: Più in generale, da utilizzare con una funzione mock la cui firma è `R(Args...)` l'oggetto può essere qualsiasi cosa convertibile in `OnceAction<R(Args...)>` o `Action<R(Args...)>`.

source: More importantly, a cardinality can be "fuzzy", just like a matcher can be.
it_it: Ancora più importante, una cardinalità può essere "fuzzy" (vago), proprio come può esserlo un matcher.

source: More iterations lead to better designs!
it_it: Più iterazioni portano a progetti migliori!

source: More specifically,
it_it: Più specificamente,

source: More specifically, you will give your code a template type argument for the type of the packet stream.
it_it: Più specificamente, si fornirà al codice un argomento di tipo template per il tipo di stream di packet.

source: Most STL-style containers support ==, so you can use Eq(expected_container) or simply expected_container to match a container exactly.
it_it: La maggior parte dei contenitori in stile STL supportano ==, quindi si può usare Eq(expected_container) o semplicemente expected_container per match-are esattamente un contenitore.

source: Most STL-style containers support `==`, so you can use `Eq(expected_container)` or simply `expected_container` to match a container exactly.
it_it: La maggior parte dei contenitori in stile STL supportano `==`, quindi si può usare `Eq(expected_container)` o semplicemente `expected_container` per match-are esattamente un contenitore.

source: Most matchers can be simply defined using the MATCHER* macros, which are terse and flexible, and produce good error messages.
it_it: La maggior parte dei matcher può essere definita semplicemente utilizzando le macro MATCHER*, che sono concise e flessibili e producono buoni messaggi di errore.

source: Most matchers can be simply defined using [the MATCHER* macros](#NewMatchers), which are terse and flexible, and produce good error messages.
it_it: La maggior parte dei matcher può essere definita semplicemente utilizzando [le macro MATCHER*](#NewMatchers), che sono concise e flessibili e producono buoni messaggi di errore.

source: Most users should *not* need to write their own `main` function and instead link with `gtest_main` (as opposed to with `gtest`), which defines a suitable entry point.
it_it: La maggior parte degli utenti *non* dovrebbe aver bisogno di scrivere la propria funzione `main` e linkare invece `gtest_main` (al contrario di `gtest`), che definisce un punto di ingresso adeguato.

source: Most users should not need to write their own main function and instead link with gtest_main (as opposed to with gtest), which defines a suitable entry point.
it_it: La maggior parte degli utenti non dovrebbe aver bisogno di scrivere la propria funzione main e linkare invece gtest_main (al contrario di gtest), che definisce un punto di ingresso adeguato.

source: Multi-argument Matchers {#MultiArgMatchers}
it_it: Matcher Multi-argomento {#MultiArgMatchers}

source: Must be called before RUN_ALL_TESTS() is called.
it_it: Deve essere chiamato prima di RUN_ALL_TESTS().

source: Must be called before RUN_ALL_TESTS() is invoked, otherwise behavior is undefined.
it_it: Deve essere chiamato prima che venga invocato RUN_ALL_TESTS(), altrimenti il comportamento non è definito.

source: Must be called before [`RUN_ALL_TESTS()`](#RUN_ALL_TESTS) is called.
it_it: Deve essere chiamato prima di [`RUN_ALL_TESTS()`](#RUN_ALL_TESTS).

source: Must be called before [`RUN_ALL_TESTS()`](#RUN_ALL_TESTS) is invoked, otherwise behavior is undefined.
it_it: Deve essere chiamato prima che venga invocato [`RUN_ALL_TESTS()`](#RUN_ALL_TESTS), altrimenti il comportamento non è definito.

source: Must be called before `RUN_ALL_TESTS()` is invoked, otherwise behavior is undefined.
it_it: Deve essere chiamato prima che venga invocato `RUN_ALL_TESTS()`, altrimenti il comportamento non è definito.

source: My SetUp() function is not called.
it_it: La funzione SetUp() non viene chiamata.

source: My code calls a static/global function.
it_it: Il mio codice chiama una funzione statica/globale.

source: My compiler complains "void value not ignored as it ought to be." What does this mean?
it_it: Il mio compilatore dice "void value not ignored as it ought to be". Cosa significa?

source: My compiler complains about "ignoring return value" when I call RUN_ALL_TESTS().
it_it: Il compilatore dice "ignoring return value" quando si chiama RUN_ALL_TESTS().

source: My compiler complains that a constructor (or destructor) cannot return a value.
it_it: Il compilatore dice che un costruttore (o un distruttore) non può restituire un valore.

source: My death test hangs (or seg-faults).
it_it: Il mio death test si blocca (o ci sono errori seg-fault).

source: My death test modifies some state, but the change seems lost after the death test finishes.
it_it: Il mio "death test" modifica alcuni stati, ma il cambiamento sembra perso al termine del test.

source: My mock object needs to do complex stuff.
it_it: Il mio oggetto mock deve fare cose complesse.

source: My program crashed and ScopedMockLog spit out tons of messages.
it_it: Il mio programma è crashato e ScopedMockLog ha inviato tonnellate di messaggi.

source: My program crashed and `ScopedMockLog` spit out tons of messages.
it_it: Il mio programma è crashato e `ScopedMockLog` ha inviato tonnellate di messaggi.

source: NOTE:
it_it: NOTA:

source: NaggyMock<MockClass> my_mock("some", "args"); EXPECT_CALL(my_mock, DoSomething()); ... code that uses my_mock ...
it_it: NaggyMock<MockClass> my_mock("some", "args"); EXPECT_CALL(my_mock, DoSomething()); ... codice che usa my_mock ...

source: NaggyMock<MockFoo> naggy_foo; // The type is a subclass of MockFoo.
it_it: NaggyMock<MockFoo> naggy_foo; // Il tipo è una sottoclasse di MockFoo.

source: Naturally, you won't want to mess with it from multiple threads or when there still are mocks in action.
it_it: Naturalmente, non ci si vorrà ingarbugliare con più thread o quando ci sono ancora mock in azione.

source: Needless to say, this can be tedious and obscures the intent of the test.
it_it: Inutile dire che questo può essere noioso e oscurare lo scopo del test.

source: Nevertheless, we cover them here for completeness.
it_it: Tuttavia, li descriviamo qui per completezza.

source: New
it_it: Nuova

source: Next steps
it_it: Passi successivi

source: Next, associate a list of types with the test suite, which will be repeated for each type in the list:
it_it: Poi, si associa un elenco di tipi alla test suite, che verrà ripetuto per ogni tipo nell'elenco:

source: Next, declare that you will define a type-parameterized test suite:
it_it: Successivamente, si dichiara che si definirà una test suite con tipi parametrizzati:

source: Next, we use MakePolymorphicAction() to turn an instance of the implementation class into the polymorphic action we need.
it_it: Poi, usiamo MakePolymorphicAction() per trasformare un'istanza della classe di implementazione nell'azione polimorfica di cui abbiamo bisogno.

source: Next, we use `MakePolymorphicAction()` to turn an instance of the implementation class into the polymorphic action we need.
it_it: Poi, usiamo `MakePolymorphicAction()` per trasformare un'istanza della classe di implementazione nell'azione polimorfica di cui abbiamo bisogno.

source: Next, you need a way to say that you want to use ConcretePacketStream in production code, and use MockPacketStream in tests.
it_it: Successivamente, c'è bisogno di un modo per dire che si vuole utilizzare ConcretePacketStream nel codice di produzione mentre MockPacketStream nei test.

source: Next, you need a way to say that you want to use `ConcretePacketStream` in production code, and use `MockPacketStream` in tests.
it_it: Successivamente, c'è bisogno di un modo per dire che si vuole utilizzare `ConcretePacketStream` nel codice di produzione mentre `MockPacketStream` nei test.

source: Next, you'll create the CMakeLists.txt file and declare a dependency on GoogleTest.
it_it: Poi, si creerà il file CMakeLists.txt e si dichiarerà una dipendenza da GoogleTest.

source: Next, you'll create the `CMakeLists.txt` file and declare a dependency on GoogleTest.
it_it: Poi, si creerà il file `CMakeLists.txt` e si dichiarerà una dipendenza da GoogleTest.

source: Next, you’ll create the WORKSPACE file to specify dependencies.
it_it: Poi, si crea il file WORKSPACE per specificare le dipendenze.

source: Next, you’ll create the `WORKSPACE` file to specify dependencies.
it_it: Poi, si crea il file `WORKSPACE` per specificare le dipendenze.

source: NiceMock<MockClass> my_mock("some", "args"); EXPECT_CALL(my_mock, DoSomething()); ... code that uses my_mock ...
it_it: NiceMock<MockClass> my_mock("some", "args"); EXPECT_CALL(my_mock, DoSomething()); ... codice che usa my_mock ...

source: No matter if the argument is a function pointer, a functor, or a callback.
it_it: Non importa se l'argomento è un puntatore a funzione, un funtore o una callback.

source: No problem - just wrap it inside std::ref():
it_it: Nessun problema: basta racchiuderlo all'interno di std::ref():

source: No problem - just wrap it inside `std::ref()`:
it_it: Nessun problema: basta racchiuderlo all'interno di `std::ref()`:

source: No silver bullet - sorry!
it_it: Spiacenti: nessuna soluzione miracolosa!

source: No special attention is required:
it_it: Non è richiesta alcuna attenzione particolare:

source: No test suite name is specified for this macro.
it_it: Per questa macro non è specificato alcun nome di test suite.

source: No value is returned.
it_it: Non viene restituito alcun valore.

source: No wonder people go great distance to avoid it.
it_it: Non c'è da stupirsi che si facciano lunghi giri per evitarlo.

source: None of its members is virtual.
it_it: Nessuno dei suoi membri è virtual.

source: None of the tests listed are actually run if the flag is provided.
it_it: Nessuno dei test elencati viene effettivamente eseguito se viene fornito il flag.

source: Nonfatal assertion
it_it: Asserzione non-fatale

source: Normally the compiler will define one for you.
it_it: Normalmente il compilatore ne definisce uno.

source: Not all tests need to be run at all times, particularly if you are making changes in the code that affect only specific modules.
it_it: Non è necessario eseguire sempre tutti i test, in particolare se si apportano modifiche al codice che interessano solo moduli specifici.

source: Not really.
it_it: Non proprio.

source: Note that many standard libraries (like STL) may throw when exceptions are enabled in the compiler.
it_it: Notare che molte librerie standard (come STL) potrebbero generare un'eccezione quando queste sono abilitate nel compilatore.

source: Note that RUN_ALL_TESTS() runs all tests in your link unit--they can be from different test suites, or even different source files.
it_it: Notare che RUN_ALL_TESTS() esegue tutti i test nella [link unit]--possono appartenere a diverse test suite, o anche a diversi file sorgenti.

source: Note that different tests in the same test suite have different test fixture objects, and GoogleTest always deletes a test fixture before it creates the next one.
it_it: Si tenga presente che test diversi nella stessa suite di test hanno oggetti fixture di test diversi e GoogleTest elimina sempre una fixture di test prima di creare quella successiva.

source: Note that removing this object from the listener list with Release() transfers its ownership to the caller and makes this function return NULL the next time.
it_it: Notare che rimuovendo questo oggetto dall'elenco dei listener con Release() ne trasferisce la proprietà al chiamante e fa sì che questa funzione restituisca NULL la volta successiva.

source: Note that SetUpTestSuite() may be called multiple times for a test fixture class that has derived classes, so you should not expect code in the function body to be run only once.
it_it: Notare che SetUpTestSuite() può essere chiamato più volte per una classe fixture che ha classi derivate, quindi non ci si deve aspettare che il codice nel corpo della funzione venga eseguito solo una volta.

source: Note that SquareRootTest.* means all tests belonging to SquareRootTest, and -SquareRootTest.Zero* means don't run those tests whose names begin with Zero.
it_it: Notare che SquareRootTest.* indica tutti i test appartenenti a SquareRootTest, e -SquareRootTest.Zero* dice di non eseguire i test i cui i nomi iniziano con Zero.

source: Note that RUN_ALL_TESTS automatically detects and runs all the tests defined using the TEST macro.
it_it: Notare che RUN_ALL_TESTS rileva ed esegue automaticamente tutti i test definiti utilizzando la macro TEST macro.

source: Note that GoogleTest takes ownership of the registered environment objects.
it_it: Si noti che GoogleTest assume la proprietà degli oggetti dell'ambiente registrati.

source: Note that `RUN_ALL_TESTS()` runs *all tests* in your link unit--they can be from different test suites, or even different source files.
it_it: Notare che `RUN_ALL_TESTS()` esegue *tutti i test* nella [link unit]--possono appartenere a diverse test suite, o anche a diversi file sorgenti.

source: Note that `SetUpTestSuite()` may be called multiple times for a test fixture class that has derived classes, so you should not expect code in the function body to be run only once.
it_it: Notare che `SetUpTestSuite()` può essere chiamato più volte per una classe fixture che ha classi derivate, quindi non ci si deve aspettare che il codice nel corpo della funzione venga eseguito solo una volta.

source: Note that a death test only cares about three things:
it_it: Notare che un death test si preoccupa solo di tre cose:

source: Note that an expectation doesn't retire automatically when it's saturated.
it_it: Notare che una expectation viene ritirata automaticamente quando è saturata.

source: Note that both ON_CALL and EXPECT_CALL have the same "later statements take precedence" rule, but they don't interact.
it_it: Notare che sia ON_CALL che EXPECT_CALL hanno la stessa regola "le istruzioni successive hanno la precedenza", ma non interagiscono.

source: Note that both `ON_CALL` and `EXPECT_CALL` have the same "later statements take precedence" rule, but they don't interact.
it_it: Notare che sia `ON_CALL` che `EXPECT_CALL` hanno la stessa regola "le istruzioni successive hanno la precedenza", ma non interagiscono.

source: Note that both the matcher description and its parameter are printed, making the message human-friendly.
it_it: Notare che vengono stampati sia la descrizione del matcher che il suo parametro, rendendo il messaggio di facile comprensione.

source: Note that commas in arguments prevent MOCK_METHOD from parsing the arguments correctly if they are not appropriately surrounded by parentheses.
it_it: Notare che le virgole negli argomenti impediscono a MOCK_METHOD di analizzare correttamente gli argomenti se non sono adeguatamente racchiusi tra parentesi.

source: Note that commas in arguments prevent `MOCK_METHOD` from parsing the arguments correctly if they are not appropriately surrounded by parentheses.
it_it: Notare che le virgole negli argomenti impediscono a `MOCK_METHOD` di analizzare correttamente gli argomenti se non sono adeguatamente racchiusi tra parentesi.

source: Note that even though your fixture is a friend to your production class, your tests are not automatically friends to it, as they are technically defined in sub-classes of the fixture.
it_it: Notare che anche se la fixture è friend della classe di produzione, i test non lo sono automaticamente, poiché sono tecnicamente definiti in sottoclassi della fixture.

source: Note that if a piece of code throws an exception, we don't consider it "death" for the purpose of death tests, as the caller of the code could catch the exception and avoid the crash.
it_it: Si noti che se un pezzo di codice genera un'eccezione, non la si considera "morte" ai fini dei "death test", poiché il chiamante del codice potrebbe rilevare l'eccezione ed evitare il crash.

source: Note that if the given predicate is an overloaded function or a function template, the assertion macro might not be able to determine which version to use, and it might be necessary to explicitly specify the type of the function.
it_it: Si noti che se il predicato fornito è l'overload di una funzione o un funzione template, la macro di asserzione potrebbe non essere in grado di determinare quale versione utilizzare e potrebbe essere necessario specificare esplicitamente il tipo della funzione.

source: Note that if you want to pass the arguments to a predicate of your own (e.g. .With(Args<0, 1>(Truly(&MyPredicate)))), that predicate MUST be written to take a std::tuple as its argument; gMock will pass the n selected arguments as one single tuple to the predicate.
it_it: Si noti che per passare gli argomenti a un proprio predicato (p.es. .With(Args<0, 1>(Truly(&MyPredicate)))), quel predicato DEVE essere scritto per accettare un std::tuple come argomento; gMock passerà gli n argomenti selezionati come una singola tupla al predicato.

source: Note that if you want to pass the arguments to a predicate of your own (e.g. `.With(Args<0, 1>(Truly(&MyPredicate)))`), that predicate MUST be written to take a `std::tuple` as its argument; gMock will pass the `n` selected arguments as *one* single tuple to the predicate.
it_it: Si noti che per passare gli argomenti a un proprio predicato (p.es. `.With(Args<0, 1>(Truly(&MyPredicate)))`), quel predicato DEVE essere scritto per accettare un `std::tuple` come argomento; gMock passerà gli `n` argomenti selezionati come *una* singola tupla al predicato.

source: Note that in Property(&Foo::baz, ...), method baz() must take no argument and be declared as const.
it_it: Notare che in Property(&Foo::baz, ...), il metodo baz() non deve accettare argomenti ed essere dichiarato come const.

source: Note that in `Property(&Foo::baz, ...)`, method `baz()` must take no argument and be declared as `const`.
it_it: Notare che in `Property(&Foo::baz, ...)`, il metodo `baz()` non deve accettare argomenti ed essere dichiarato come `const`.

source: Note that in this example, it wasn't necessary to specify the positional matchers.
it_it: Si noti che in questo esempio, non è stato necessario specificare i matcher posizionali.

source: Note that it should explain why the match succeeds in case of a success (unless it's obvious) - this is useful when the matcher is used inside Not().
it_it: Notare che dovrebbe spiegare perché la corrispondenza ha successo in caso di successo (a meno che non sia ovvio) - questo è utile quando il matcher viene utilizzato all'interno di Not().

source: Note that it should explain why the match succeeds in case of a success (unless it's obvious) - this is useful when the matcher is used inside `Not()`.
it_it: Notare che dovrebbe spiegare perché la corrispondenza ha successo in caso di successo (a meno che non sia ovvio) - questo è utile quando il matcher viene utilizzato all'interno di `Not()`.

source: Note that it uses the TEST_F macro instead of TEST.
it_it: Notare che utilizza la macro TEST_F anziché TEST.

source: Note that removing this object from the listener list with [`Release()`](#TestEventListeners::Release) transfers its ownership to the caller and makes this function return `NULL` the next time.
it_it: Notare che rimuovendo questo oggetto dall'elenco dei listener con [`Release()`](#TestEventListeners::Release) ne trasferisce la proprietà al chiamante e fa sì che questa funzione restituisca `NULL` la volta successiva.
